package com.company;

public class Task5 {

   // Основные задачи:

    // Задача 1. Используя цикл for вывести те числа которые делятся на 5 но не делятся на 3
    // из интервала 1...100
    public static void exercise01() {

    }

    // Задача 2. Вывести все простые числа из интервала 1...100
    public static void exercise02() {

    }

    // Задача 3. Пользователь поочередно вводит числа, пока не введет 0,
    // найти из среднее арифметичесткое, использовать break
    public static void exercise03() {

    }

    // Дополнительные задачи:

    // Задача 1. Написать метод, который принимает 2 целых числа и возвращает их наибольший общий делитель
    public static void exercise001() {

    }

    // Задача 2. Пользователь вводит число описывающее марштур? где каждая цифра означает направление
    // 1 - прямо, 2 - направо, 3 - налево, вывести этот маршрут текстом, причем если единица повторяется
    // вывести "продолжайте движение прямо"
    // Например? если пользователь введет 1211312
    // двигайтесь прямо
    // поверните направо
    // двигайтесь прямо
    // продолжайте движение прямо
    // поверните налево
    // двигайтесь прямо
    // повернитесь направо
    public static void exercise002() {

    }

    public static void main(String[] args) {
	// write your code here
    }
}
